# Identifier Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationItemFile..::..Identifier Property
FabricationItemFile Class See Also
---
The string identifier for the item file. This string is unique and can be used to compare whether fabrication item files are the same file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public string Identifier { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Identifier As String
	Get
```

Visual C++
---
```text
public:
property String^ Identifier {
	String^ get ();
}
```

# See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace